# 1. DEFINE A PANDAS DATAFRAME

In [6]:
import pandas as pd

In [15]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank Client Id': [111, 222, 333, 444],
                               'Bank Client Name': ['Laila Aly', 'Kate Steve', 'Nicole Mitch', 'Francis Morris'],
                               'Net Worth [$]': [35_000, 3000, 100_000, 2000],
                               'Years with Bank': [4, 7, 10, 15]})
bank_client_df

   Bank Client Id Bank Client Name  Net Worth [$]  Years with Bank
0             111        Laila Aly          35000                4
1             222       Kate Steve           3000                7
2             333     Nicole Mitch         100000               10
3             444   Francis Morris           2000               15

In [16]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [18]:
# you can only view the first couple of rows using .head()
bank_client_df.head(3)

   Bank Client Id Bank Client Name  Net Worth [$]  Years with Bank
0             111        Laila Aly          35000                4
1             222       Kate Steve           3000                7
2             333     Nicole Mitch         100000               10

In [12]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail(1)

   Bank Client Id Bank Client Name  Years with Bank
3             444   Francis Morris               15

In [19]:
# You can obtain the shape of the DataFrame (#rows, #columns)
bank_client_df.shape

(4, 4)

In [20]:
# Obtain DataFrame information 
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Bank Client Id    4 non-null      int64
 1   Bank Client Name  4 non-null      object
 2   Net Worth [$]     4 non-null      int64
 3   Years with Bank   4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [28]:
portfolio_df = pd.DataFrame({'Ticker Symbol': ['AAPL', 'MSFT', 'AMZN', 'NVDA'],
                             'Number of shares': [4, 6, 9, 20],
                             'Price per Share': [184.31, 371.51 ,149.37, 475.51]})
portfolio_df
stocks_dollar_value = portfolio_df['Price per Share'] * portfolio_df['Number of shares']
print(f'Total portfolio value: {stocks_dollar_value.sum()}')

Total portfolio value: 13820.830000000002

# 2. INPUTS (READ CSV AND HTML DATA)

In [29]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv('bank_client_information.csv')

In [30]:
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [31]:
# Read tabular data using read_html
house_prices_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [33]:
house_prices_df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [34]:
house_prices_df[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [38]:
retirement_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_df[0]

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...

# 3. OUTPUTS (WRITE DATAFRAME INTO CSV)

In [39]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [44]:
# write to a csv file without an index
bank_df.to_csv('sample_output_index.csv', index=True)

**MINI CHALLENGE #3:**
- **Use set index = False and rerun the cell. Comment on the output CSV.**
- **Try to leverage the attribute compression and rerun the cell**

In [45]:
bank_df.to_csv('sample_output_no_index.csv', index=False)

In [46]:
bank_df.to_csv('sample_output_no_index.csv.gz', index=False, compression='gzip')

# 4. SETTING/RESETTING INDEX

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame
# Note that a numeric index is being set by default

In [ ]:
# You can assign a specific column to be the index as follows

In [ ]:
# You can go back and use numeric index using reset_index

In [ ]:
# Alternatively, you can set the index name when you read the csv file as follows

**MINI CHALLENGE #4:**
- **Load the bank_client_information.csv and then set the "Last Name" column as the index**

# 5. SELECTING COLUMNS FROM A DATAFRAME

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame

In [ ]:
# Return a column from the DataFrame
# Note that the output will be a Pandas Series (you can automatically tell by the lack of formating)

In [ ]:
# Confirm the datatype of sample

In [ ]:
# Alternatively, you can use the following syntax to do the same
# Note that this method will not work if there are spaces in the column names

In [ ]:
# Since the column name has spaces, this will be the only way that will work!

In [ ]:
# Let's select multiple columns from the DataFrame
# you need to define a list containing all column names that you would like to select
# Note that since we collected more than one column, the output is a DataFrame (Notice the rich formatting)

In [ ]:
# Note that sample is now a DataFrame and not a Pandas Series (since it has multiple columns)
# You can use type to confirm or you can tell from the rich text formating

In [ ]:
# Alternatively, you can define a list first and then use it to select columns

In [ ]:
# In order to access a given row in the dataframe

**MINI CHALLENGE #5:**
- **Select the following columns from the dataFrame Net Worth, Years with Bank, and Postal Code**

# 6. ADDING/DELETING COLUMNS TO DATAFRAME

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame

In [ ]:
# Let's assume that we want to add a new column to the dataframe

In [ ]:
# You can also insert a new column in a given position

In [ ]:
# Delete a column from a DataFrame

In [ ]:
# Remove a column from a DataFrame and store it somehwere else using pop

**MINI CHALLENGE #6:**
- **load the bank_client_information.csv file and perform the following: (assume any reasonable values)** 
    - **Add a column indicating whether the client has a mortgage or not**
    - **Add a column indicating the value of mortage in dollars**

# 7. LABEL-BASED ELEMENTS SELECTION FROM A DATAFRAME ".LOC()"

In [ ]:
# Load the csv file and set the last name as the index

In [ ]:
# Sort the dataframe in an alphabetical order

In [ ]:
# loc is used to filter rows and columns
# loc is label-based meaning you need to give a name of the rows (or columns) that you are interested in selecting
# Note that iloc is "integer index-based" meaning you can filter rows/columns by their integer index.
# Note that we obtained a Series because last name "Small" existed only once in the dataframe

In [ ]:
# Note that you got a DataFrame back since Last Name 'Steve' existed more than one in the DataFrame

In [ ]:
# Note that you can select multiple rows using "colon :"
# Note that this is inclusive! meaning that "Ahmed" and "Patton" were selected in the output DataFrame
# Headsup: this will be different if we use integer based index such as iloc()

In [ ]:
# Select all elements up to and including 'Keller' index

In [ ]:
# if you want to select multiple rows, you can pass them as a list as follows

In [ ]:
# You can also randomly select a fraction of the DataFrame
# Setting axis = 0 means rows, setting index = 1 means columns

In [ ]:
# return a percentage (Ex: 30%) of the rows

**MINI CHALLENGE #7:**
- **Load the csv data and use the "first name" column as the index**
- **Randomly select 2 rows from the DataFrame. Rerun the code and ensure that random rows are being selected**

# 8. INTEGER INDEX-BASED ELEMENTS SELECTION FROM A DATAFRAME "iLOC()"

In [ ]:
# Load the CSV file with default index

In [ ]:
# You can access rows with their numeric index using iloc

In [ ]:
# You can access multiple rows with their numeric index using iloc and colon :
# Note that using iloc is exclusive, meaning that we did not include the last element (quite confusing I know!)
# We went from index = 2 up until and not including index 5 so index 2,3, and 4 are the one selected

In [ ]:
# all up until and not including index 4

In [ ]:
# Multiple elements are selected using a list of indexes

In [ ]:
# Slicing a piece of the dataframe by selecting which row and column you would like to select

**MINI CHALLENGE #8:**
- **Write a code that selects the last two rows in the DataFrame using two different methods**

# 9. BROADCASTING OPERATIONS & SETTING NEW DATAFRAME VALUES

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame

In [ ]:
# Let's assume that we want to update the networth of all our customers by $1000

In [ ]:
# Alternatively, you can add or subtract as follows

In [ ]:
# Let's convert from USD to CAD using the exchange rate 1 USD = 1.3 CAD

In [ ]:
# Decided to update the email address of a given customer

In [ ]:
# Let's assume we want to update the networth of two clients

**MINI CHALLENGE #9:**
- **Let's assume that all clients in the bank has been investing their assets in a broad S&P500 ETF. The market has been performing really well and clients networth has increased by 12% annualy. Calculate the sum of all client's networth.**

# 10. SORTING AND ORDERING

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# You can sort the values in the dataframe according to number of years with bank

In [ ]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True

In [ ]:
# Set inplace = True to ensure that change has taken place in memory

In [ ]:
# Note that now the change (ordering) took place

In [ ]:
# You can sort the values in a descending order as follows

In [ ]:
# You can sort the dataframe with index instead of values as follows

**MINI CHALLENGE #10:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

# 11. PANDAS WITH FUNCTIONS

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# Define a function that increases all clients networth by a fixed value of 10% (for simplicity sake)

In [ ]:
# You can apply a function to the DataFrame

**MINI CHALLENGE #11:**
- **Define a function that doubles an argument and adds $100**
- **Apply the function to the Net Worth Column in the DataFrame**
- **Calculate the updated total networth of all clients combined**

# 12. PANDAS OPERATIONS/FILTERING

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# Pick certain rows that satisfy a certain criteria

In [ ]:
# Pick certain rows that satisfy 2 or more critirea

In [ ]:
# Pick certain rows that satisfy a certain criteria

In [ ]:
# values that fall between a given range

In [ ]:
# Delete duplicated rows

In [ ]:
# add a tilde symbol ~

In [ ]:
# Let's read a CSV file using Pandas as follows


# Drop duplicates

In [ ]:
# We can also filter the Dataframe using the where method as follows
# Note that all rows that don't satisfy this critirea are set to NaN

**MINI CHALLENGE #12:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $15000** 
- **What is the combined networth for all customers with 15000+ networth?**

# 13. FEATURE ENGINEERING AND DEALING WITH MISSING DATASET

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# first, let's locate rows that have Null values

In [ ]:
# first, let's locate rows that have Null values

In [ ]:
# Drop any row that contains a Null value 
# Note that the size of the dataframe has been reduced by 7 elements
# Note that all will be used to drop rows that contains only Null values

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# We can also indicate which columns we want to drop NaN from

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# Calculate the average monthly income

In [ ]:
# You can use Fillna to fill a given column with a certain value

**MINI CHALLENGE #13:**
- **Calculate the median monthly rate. Use the calculated median values to fill out missing data. Confirm that the process is successful**

# 14. CHANGE DATATYPES

In [ ]:
# Let's read a CSV file using Pandas as follows

In [ ]:
# Let's convert the hourly rate from int64 to float64

In [ ]:
# Since we have limited number of classes, we can use the categrory datatype
# check the memory usage with the info method to ensure that the size has been reduced

In [ ]:
# Notice the reduction in size

**MINI CHALLENGE #14:**
- **Convert the BusinessTravel column to category format.** 
- **How many KBytes in memory have been saved?**

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)

In [ ]:
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [ ]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

**MINI CHALLENGE #3 SOLUTION:**
- **Use set index = False and rerun the cell. Comment on the output CSV.**
- **Try to leverage the attribute compression and rerun the cell**

In [ ]:
# write to a csv file without an index
bank_df.to_csv('sample_output_noindex.csv', index = False)

In [ ]:
# write to a csv file with an index + gzip Compression
bank_df.to_csv('sample_output_noindex.csv.gz', index = False, compression = 'gzip')

**MINI CHALLENGE #4 SOLUTION:**
- **Load the bank_client_information.csv and then set the "Last Name" column as the index**

In [ ]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

In [ ]:
# You can assign a specific column to be the index as follows
bank_df.set_index("Last Name", inplace = True)
bank_df

**MINI CHALLENGE #5 SOLUTION:**
- **Select the following columns from the dataFrame Net Worth, Years with Bank, and Postal Code**

In [ ]:
my_selected_columns = ['Net Worth', 'Years with Bank', 'Postal Code']
sample = bank_df[my_selected_columns]
sample

**MINI CHALLENGE #6 SOLUTION:**
- **load the bank_client_information.csv file and perform the following: (assume any reasonable values)** 
    - **Add a column indicating whether the client has a mortgage or not**
    - **Add a column indicating the value of mortage in dollars**

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

# Let's assume that we want to add a new column to the dataframe
bank_df['Has Mortage'] = [1, 1, 0, 0, 0, 0, 1, 0, 0, 0]
bank_df['Mortage Value'] = [200000, 130000, 0, 0, 0, 0, 400000, 0, 0, 0]
bank_df

**MINI CHALLENGE #7 SOLUTION:**
- **Load the csv data and use the "first name" column as the index**
- **Randomly select 2 rows from the DataFrame. Rerun the code and ensure that random rows are being selected**

In [ ]:
# Load the csv file and set the last name as the index
bank_df = pd.read_csv('bank_client_information.csv', index_col = 'First Name')
bank_df
# You can also randomly select a fraction of the DataFrame
# Setting axis = 0 means rows, setting index = 1 means columns
bank_df.sample(n = 2, axis = 0)

**MINI CHALLENGE #8 SOLUTION:**
- **Write a code that selects the last two rows in the DataFrame using two different methods**

In [ ]:
bank_df.iloc[8:]

In [ ]:
bank_df.iloc[-2:]

**MINI CHALLENGE #9 SOLUTION:**
- **Let's assume that all clients in the bank has been investing their assets in a broad S&P500 ETF. The market has been performing really well and clients networth has increased by 12% annualy. Calculate the sum of all client's networth.**

In [ ]:
# Pandas is used to read a csv file and store data in a DataFrame
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

In [ ]:
# Let's convert from USD to CAD using the exchange rate 1 USD = 1.3 CAD 
bank_df['Net Worth New'] = bank_df['Net Worth'].mul(1.12)
bank_df

In [ ]:
bank_df['Net Worth New'].sum()

In [ ]:
print("Total networth for all clients = ${}".format( bank_df['Net Worth New'].sum()))

**MINI CHALLENGE #10 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [ ]:
# You can sort the values in the dataframe according to number of years with bank
bank_df.sort_values(by = 'Net Worth', inplace = True) 
bank_df

**MINI CHALLENGE #11 SOLUTION:**
- **Define a function that doubles an argument and adds $100**
- **Apply the function to the Net Worth Column in the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [ ]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [ ]:
# You can apply a function to the DataFrame 
results = bank_df['Net Worth'].apply(networth_update)
results

In [ ]:
results.sum()

**MINI CHALLENGE #12 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $15000** 
- **What is the combined networth for all customers with 15000+ networth?**

In [ ]:
df_high_networth = bank_df[ (bank_df['Net Worth'] >= 15000) ]
df_high_networth

In [ ]:
df_high_networth['Net Worth'].sum()

**MINI CHALLENGE #13 SOLUTION:**
- **Calculate the median monthly rate. Use the calculated median values to fill out missing data. Confirm that the process is successful**

In [ ]:
# Let's read a CSV file using Pandas as follows
employee_df = pd.read_csv('Human_Resources.csv')
employee_df

In [ ]:
# first, let's locate rows that have Null values
employee_df.isnull().sum()

In [ ]:
# Calculate the average monthly income
employee_df['MonthlyRate'].median()

In [ ]:
# You can use Fillna to fill a given column with a certain value
employee_df['MonthlyRate'].fillna(employee_df['MonthlyRate'].median(), inplace = True)

In [ ]:
employee_df

In [ ]:
# first, let's locate rows that have Null values
employee_df.isnull().sum()

**MINI CHALLENGE #14 SOLUTION:**
- **Convert the BusinessTravel column to category format.** 
- **How many KBytes in memory have been saved?**

In [ ]:
# Let's read a CSV file using Pandas as follows
employee_df = pd.read_csv('Human_Resources.csv')
employee_df.info()

In [ ]:
employee_df["BusinessTravel"] = employee_df['BusinessTravel'].astype("category")
employee_df.info()

In [ ]:
# 402.1+ KB vs. 392.1+ KB

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df